[
  {
    "Index": 1,
    "cryptid-name": "Á Bao A Qu",
    "Aliases/Also Known As": "N/A",
    "Media Mentions": "Mentioned in Borges’ Book of Imaginary Beings and occasionally referenced in philosophical discussions on imaginary entities. Sparse appearances in literary analysis texts and metafiction essays. Media mentions are almost nonexistent outside academic or surrealist literature circles.",
    "Type": "Spirit Entity",
    "Specific Location(s)": "India, Rajasthan, Chitor",
    "Folklore": "Originates from Borges’ literary invention, said to haunt the Tower of Victory in India as a spiritual mirror.",
    "Traits": "Glowing, translucent, silent, humanoid shape, dependent on purity",
    "Danger Level": 3.5,
    "Behavior": "It is passive and non-aggressive, remaining still until approached by a pure soul. When touched by impurity, it retreats and fades.",
    "Summary": "Á Bao A Qu is a spectral being said to inhabit the Tower of Victory in Chitor, India. According to legends, the spirit glows more brightly and gains definition when approached by someone of moral excellence. The purer the soul, the more complete the form becomes. If touched by someone impure, it recoils and dissolves into obscurity. This creature represents the connection between spiritual purity and metaphysical form. It does not speak or interact violently. Folklore describes it as watching quietly until disturbed. No physical evidence or sightings exist beyond literary mention.",
    "First Reported Sightings": 1948,
    "Reported Sightings (Approx.)": 1,
    "Hoaxes": "Believed to be a symbolic invention by Borges rather than a product of historical sightings. It has no ties to any real-world culture or documented encounter. Its role is purely literary, serving as an allegorical creature within Borges’ philosophical work.",
    "Debunked (Y/N)": "Yes",
    "Cryptid Popularity Score": 2,
    "image": null
  },
  {
    "Index": 2,
    "cryptid-name": "A-Mi-Kuk",
    "Aliases/Also Known As": "Amikuk",
    "Media Mentions": "Appears in a small number of Inuit folklore compilations and regional ethnographic notes. Mentioned briefly in niche online lists of Arctic cryptids and mythic beasts. Media mentions are virtually nonexistent outside native oral tradition write-ups.",
    "Type": "Humanoid Cryptid",
    "Specific Location(s)": "Alaska, Arctic Circle, Inuit territories",
    "Folklore": "Inuit folklore describes it as a sea creature that emerges from beneath ice to drag prey below.",
    "Traits": "Tall, shadowy, human-shaped, silent, persistent",
    "Danger Level": 7,
    "Behavior": "Described as silent but relentless, typically emerging in icy regions to stalk travelers. Rarely interacts directly but induces fear and paranoia.",
    "Summary": "The A-Mi-Kuk is a shadowy humanoid figure from Inuit folklore believed to roam the Arctic wilderness. It is often depicted as a tall, silent stalker that trails behind hunters or explorers. The creature does not physically attack but instills overwhelming dread in those who sense it nearby. Legends suggest it is a spirit or entity born of the harsh landscape itself. A-Mi-Kuk has no known physical footprints or evidence, contributing to its spectral nature. It has been passed down through generations in oral tradition as a cautionary tale. Its role appears more psychological than physical, acting as a symbol of isolation and survival fears. No sightings have been formally documented in modern times.",
    "First Reported Sightings": "1700s",
    "Reported Sightings (Approx.)": 12,
    "Hoaxes": "No confirmed hoaxes have been documented. The creature exists primarily in Inuit oral tradition and is regarded as a cultural myth. Modern claims lack physical evidence and are considered folkloric rather than fabricated.",
    "Debunked (Y/N)": "No",
    "Cryptid Popularity Score": 1,
    "image": "A-Mi-Kuk.png"
  },
  {
    "Index": 3,
    "cryptid-name": "Aatxe",
    "Aliases/Also Known As": "Aatxegorri",
    "Media Mentions": "Referenced occasionally in Basque mythological encyclopedias and academic papers on Iberian folklore. A few fringe cryptozoology articles include passing mentions, often without citations. Media mentions are rare and largely confined to regional folklore digests.",
    "Type": "Shapeshifter",
    "Specific Location(s)": "Spain, Basque Country",
    "Folklore": "Basque legend portrays it as a protective red bull spirit that punishes evildoers.",
    "Traits": "Shapeshifting, glowing red, horned, nocturnal, wrathful",
    "Danger Level": 6,
    "Behavior": "Typically remains hidden but emerges at night to confront evildoers. Avoids human settlements unless drawn by sin or conflict.",
    "Summary": "Aatxe is a powerful shapeshifting spirit from Basque mythology, known for transforming into a red bull with glowing features. It is believed to emerge from caves to punish those who engage in evil deeds or disrespect the natural world. Aatxe represents divine justice and serves as a guardian of the innocent. It is most active at night and avoids daylight. Sightings typically involve brief encounters in mountainous regions. The creature is revered rather than feared among locals. Stories often place it near ancient megaliths or sacred groves. Aatxe is deeply tied to regional identity and spiritual symbolism. Though considered mythological, it retains cultural significance in Basque folklore.",
    "First Reported Sightings": "1500s",
    "Reported Sightings (Approx.)": 25,
    "Hoaxes": "There are no known hoaxes involving Aatxe. The red bull spirit originates from Basque mythology and is interpreted as a symbol of justice and morality. Its appearance in stories is metaphorical rather than literal.",
    "Debunked (Y/N)": "Yes",
    "Cryptid Popularity Score": 3,
    "image": "Aatxe.png"
  },
  {
    "Index": 4,
    "cryptid-name": "Abada",
    "Aliases/Also Known As": "African Unicorn",
    "Media Mentions": "Cited briefly in historical bestiaries and European unicorn compendiums. Reappears sporadically in online fantasy creature databases. Media mentions are minimal and limited to derivative lists or mythological overviews.",
    "Type": "Mythical Beast",
    "Specific Location(s)": "Democratic Republic of the Congo",
    "Folklore": "Central African stories describe it as a two-horned antelope with magical, healing properties.",
    "Traits": "Two-horned, donkey-sized, greenish tint, fast, elusive",
    "Danger Level": 2.5,
    "Behavior": "Shy and reclusive, it avoids human interaction and hides in dense vegetation.",
    "Summary": "The Abada is a lesser-known African unicorn-like creature described in early colonial accounts and folklore. Unlike the traditional European unicorn, it has two horns and resembles a small donkey or antelope. Some reports describe it as having a greenish hue or magical properties. It is said to be gentle and elusive, living deep within jungles and rarely seen. Portuguese explorers in the 16th century wrote of similar beasts in the Congo. The Abada may have originated as a misidentified rhinoceros or antelope. It is often invoked in legends as a symbol of purity and peace. The creature has not appeared in modern cryptid reports, suggesting it may be purely folkloric.",
    "First Reported Sightings": 1570,
    "Reported Sightings (Approx.)": 7,
    "Hoaxes": "Abada is often viewed as a fantastical variation of the rhinoceros described in early colonial accounts. There are no explicit hoaxes tied to it, but many of its characteristics appear to be exaggerations or misunderstandings by European explorers.",
    "Debunked (Y/N)": "Yes",
    "Cryptid Popularity Score": 2,
    "image": "Abada.png"
  },
  {
    "Index": 5,
    "cryptid-name": "Abaia",
    "Aliases/Also Known As": "N/A",
    "Media Mentions": "Mentioned in Melanesian folklore anthologies and cryptozoology blogs. Brief references in Pacific island myth studies and speculative creature books. Media mentions are almost nonexistent outside cultural storytelling collections.",
    "Type": "Aquatic Cryptid",
    "Specific Location(s)": "Fiji, Vanuatu, Solomon Islands",
    "Folklore": "Melanesian mythology speaks of it as a giant eel that defends sacred freshwater lakes from intruders.",
    "Traits": "Giant eel-like, magical, glowing eyes, water-dwelling, vengeful",
    "Danger Level": 7.5,
    "Behavior": "Generally peaceful unless its waters are threatened. Then it becomes violently protective and aggressive.",
    "Summary": "Abaia is a mythical eel-like creature from Melanesian folklore said to inhabit deep lakes and guard them fiercely. It is considered a guardian spirit of aquatic life, punishing those who pollute or exploit its habitat. The creature is said to be massive in size, often with glowing eyes and mystical power. When angered, it causes floods or swallows intruders whole. Legends often depict Abaia as wise and deeply connected to its environment. It rarely reveals itself unless provoked. Some tribes perform rituals to appease it before fishing. It plays an important role in environmental respect and balance in island cultures.",
    "First Reported Sightings": "1890s",
    "Reported Sightings (Approx.)": 3,
    "Hoaxes": "No hoaxes have been recorded for Abaia. It is a spiritual guardian figure in Melanesian mythology and is treated with reverence in its native culture. Its role is symbolic rather than zoological.",
    "Debunked (Y/N)": "No",
    "Cryptid Popularity Score": 3,
    "image": "Abaia.png"
  },
  {
    "Index": 6,
    "cryptid-name": "Abarimon",
    "Aliases/Also Known As": "Backward-Footed People",
    "Media Mentions": "Appears in classical and medieval travelogues, usually as a curiosity among imagined tribes. Referenced occasionally in fringe anthropology forums and speculative human evolution texts. Media mentions are limited and typically restate older textual myths.",
    "Type": "Mythical Beast",
    "Specific Location(s)": "India (historically Scythia), remote valleys",
    "Folklore": "Classical writings mention a tribe of backward-footed people confined to a remote valley.",
    "Traits": "Human-like, backwards feet, fast runners, inhospitable environment dwellers",
    "Danger Level": 3,
    "Behavior": "Said to be quick and territorial, rarely seen by outsiders. Interactions with them are minimal and brief.",
    "Summary": "Abarimon refers to a mythical tribe described in ancient texts as having backward-facing feet and incredible agility. These beings were believed to live in remote mountain regions, isolated from the rest of humanity. They were said to be adapted so completely to their environment that removal from it led to death. Ancient authors treated them as both marvels and warnings about nature’s extremes. Though often considered human, they were never seen in modern times and are thought to be allegorical or misinterpreted tribes. The concept persisted through medieval bestiaries and travelers' tales. No archaeological evidence supports their existence. Their story reflects early attempts to catalog exotic peoples without scientific basis.",
    "First Reported Sightings": "23 CE",
    "Reported Sightings (Approx.)": 0,
    "Hoaxes": "The Abarimon appears in medieval bestiaries and classical writings, often described as backward-footed humanoids. There are no modern hoaxes associated with it, as it functions more as a mythical anthropological curiosity.",
    "Debunked (Y/N)": "Yes",
    "Cryptid Popularity Score": 2,
    "image": "Abarimon.png"
  },
  {
    "Index": 7,
    "cryptid-name": "Abath",
    "Aliases/Also Known As": "N/A",
    "Media Mentions": "Cited only in obscure, untranslated regional folklore manuscripts. Absent from major creature catalogs or cultural encyclopedias. Media mentions are effectively nonexistent.",
    "Type": "Aquatic Cryptid",
    "Specific Location(s)": "Congo River Basin, Democratic Republic of the Congo",
    "Folklore": "Maritime lore references it as a fog-born entity associated with omens and vanishings.",
    "Traits": "Elongated body, scaled hide, bioluminescent eyes",
    "Danger Level": 6.5,
    "Behavior": "Abath is believed to be territorial and reacts aggressively when approached. It tends to remain hidden beneath murky waters and is seldom seen unless provoked.",
    "Summary": "The Abath is an elusive aquatic creature reported to inhabit the dark waters of the Congo River Basin. Descriptions often portray it as an eel-like entity with glowing eyes and armored scales. Fishermen have avoided areas rumored to be Abath territory due to disappearances and capsized boats. The creature is said to emit a low-frequency hum detectable before an encounter. While sightings are rare, its lore persists in riverside villages. No physical evidence has ever been gathered. Cryptozoologists classify it among the lesser-known water cryptids. It remains a point of cautionary tales and riverside folklore.",
    "First Reported Sightings": "1800s",
    "Reported Sightings (Approx.)": 2,
    "Hoaxes": "No documented hoaxes are tied to Abath. It exists primarily in regional folklore with very limited exposure outside oral accounts. It is regarded as a niche mythical figure rather than a widespread deception.",
    "Debunked (Y/N)": "No",
    "Cryptid Popularity Score": 1,
    "image": "Abath.png"
  },
  {
    "Index": 8,
    "cryptid-name": "Abatwa",
    "Aliases/Also Known As": "N/A",
    "Media Mentions": "Referenced occasionally in academic works on African and Pygmy folklore. A few children’s mythology books include token entries. Media mentions are rare and mostly folkloric in focus.",
    "Type": "Humanoid Cryptid",
    "Specific Location(s)": "KwaZulu-Natal, South Africa",
    "Folklore": "Zulu oral tradition holds that they are tiny, ant-riding people visible only to the pure of heart.",
    "Traits": "Tiny stature, human-like, elusive",
    "Danger Level": 2,
    "Behavior": "They are described as shy and reclusive, fleeing upon detection. They are believed to live in anthills and ride ants as mounts.",
    "Summary": "The Abatwa are miniature humanoids from Zulu mythology, said to be no taller than a few inches. They are considered one of the smallest humanoid cryptids ever recorded. Legends describe them as fully sentient beings with their own society and rules. They only reveal themselves to children under four years old, witches, or those close to death. In folklore, they often ride ants and carry tiny spears. Despite their harmless nature, offending them is said to bring misfortune. There are no confirmed sightings or physical evidence. The Abatwa persist as symbolic creatures within African spiritual traditions.",
    "First Reported Sightings": "1850s",
    "Reported Sightings (Approx.)": 10,
    "Hoaxes": "Abatwa are considered spiritual or mythic beings in Zulu and other African folklore. There is no evidence of deliberate hoax, as their existence is firmly rooted in cultural storytelling rather than attempts to deceive.",
    "Debunked (Y/N)": "No",
    "Cryptid Popularity Score": 2,
    "image": "Abatwa.png"
  },
  {
    "Index": 9,
    "cryptid-name": "Abbagoochie",
    "Aliases/Also Known As": "N/A",
    "Media Mentions": "Mentioned sporadically on cryptid discussion boards and in regional Appalachian folklore roundups. A few amateur documentaries reference it as a lesser-known Southern U.S. legend. Media mentions are scarce and limited to fringe outlets.",
    "Type": "Mammalian Cryptid",
    "Specific Location(s)": "Appalachian Mountains, Tennessee, USA",
    "Folklore": "Appalachian folklore claims it was a military-bred predator capable of wiping out livestock.",
    "Traits": "Fanged, fast-moving, fur-covered, red-eyed",
    "Danger Level": 8.5,
    "Behavior": "It is said to be extremely aggressive and predatory, targeting livestock and small animals. Accounts often describe it vanishing into the woods after an attack.",
    "Summary": "The Abbagoochie is an alleged experimental hybrid said to have escaped from military testing and now roams the Tennessee wilderness. Descriptions vary, but most agree on a fur-covered, fanged predator with glowing red eyes. It has been compared to a cross between a wildcat and an alien. Reports suggest the creature attacks without provocation and moves with unnatural speed. While no bodies or physical evidence have been recovered, sporadic livestock killings have been attributed to it. Some cryptozoologists believe it's a modern myth or local boogeyman. Others treat it as a cryptid worth further study. Rumors link its origin to Cold War bioengineering, but no official records exist.",
    "First Reported Sightings": "1940s",
    "Reported Sightings (Approx.)": 5,
    "Hoaxes": "Often referenced in Appalachian folklore, the Abbagoochie is said to have been created by the military, though this claim lacks any supporting evidence. Some believe the story may have been fabricated as a local prank or tall tale. No formal investigation into hoax claims has occurred, but skepticism is high due to its origins.",
    "Debunked (Y/N)": "Yes",
    "Cryptid Popularity Score": 4,
    "image": "Abbagoochie.png"
  },
  {
    "Index": 10,
    "cryptid-name": "Aberdeen Carcass",
    "Aliases/Also Known As": "N/A",
    "Media Mentions": "Reported briefly in UK tabloid articles following a mysterious carcass washing ashore near Aberdeen. Occasionally cited in cryptozoology compilations without confirmed origin. Media mentions are minimal and lack substantial investigation.",
    "Type": "Fossil/Extinct Cryptid",
    "Specific Location(s)": "Aberdeen, Scotland",
    "Folklore": "Scottish local legend surrounds the mystery of a massive, unidentified sea creature carcass.",
    "Traits": "Rotting flesh, massive size, flipper-like appendages",
    "Danger Level": 3,
    "Behavior": "It was passive as it was already deceased when discovered. The creature generated more curiosity than fear.",
    "Summary": "The Aberdeen Carcass refers to an unidentified animal corpse found washed up on the coast of Aberdeen in the 20th century. The carcass was partially decomposed, leading to speculation that it might be a surviving prehistoric marine reptile. Photographs and samples were taken before the remains decayed or were discarded. Experts disagreed on its identity, with suggestions ranging from basking shark to plesiosaur. The mystery was fueled by the ambiguous nature of the body's features. No definitive classification was ever reached. The event remains a footnote in cryptozoological history.",
    "First Reported Sightings": 1900,
    "Reported Sightings (Approx.)": 1,
    "Hoaxes": "The carcass was initially claimed to be a mysterious sea creature, but later assessments suggested it was likely a decomposed basking shark or known marine animal. While not a deliberate hoax, early interpretations were fueled by sensationalism. The lack of scientific rigor at the time contributed to its misidentification.",
    "Debunked (Y/N)": "Yes",
    "Cryptid Popularity Score": 5,
    "image": "Aberdeen-Carcass.png"
  },
  {
    "Index": 11,
    "cryptid-name": "Abereen Wildman",
    "Aliases/Also Known As": "N/A",
    "Media Mentions": "Mentioned in fringe African cryptid compilations and speculative zoology blogs. No mainstream or scholarly sources corroborate the name or origin. Media mentions are nearly nonexistent and unverified.",
    "Type": "Humanoid Cryptid",
    "Specific Location(s)": "Aberdeenshire, Scotland",
    "Folklore": "Scottish tales speak of a hairy forest-dwelling humanoid spotted in remote regions.",
    "Traits": "Hair-covered, tall, strong, human-like",
    "Danger Level": 6,
    "Behavior": "Avoids human contact but reacts defensively when threatened. Often seen foraging or roaming hillsides alone.",
    "Summary": "The Abereen Wildman is a regional variant of the European wild man tradition, said to inhabit remote woodlands of northeastern Scotland. Descriptions suggest a bipedal, ape-like creature covered in dark hair. Unlike Bigfoot, it is described as smaller and more humanlike. It has been blamed for missing livestock and strange footprints. Witnesses often describe a foul odor and guttural vocalizations. The creature is usually seen at dusk or dawn. Despite local rumors, no formal investigation has confirmed its existence. The Wildman persists more in legend than documented cryptozoology.",
    "First Reported Sightings": "1980s",
    "Reported Sightings (Approx.)": 9,
    "Hoaxes": "This cryptid is scarcely mentioned outside of speculative lists and lacks any verifiable origin. There are no confirmed hoaxes, though its obscurity suggests it may have been invented or misnamed in cryptid compilations.",
    "Debunked (Y/N)": "No",
    "Cryptid Popularity Score": 3,
    "image": "Abereen-Wildman.png"
  },
  {
    "Index": 12,
    "cryptid-name": "Abnauayu",
    "Aliases/Also Known As": "Abnauaiyu",
    "Media Mentions": "Included in a handful of Caucasus region folklore indexes and rare ethnographic surveys. Appears briefly in Russian cryptozoology texts and isolated expedition anecdotes. Media mentions are extremely limited and not corroborated in global sources.",
    "Type": "Humanoid Cryptid",
    "Specific Location(s)": "Caucasus Mountains, Abkhazia (Georgia)",
    "Folklore": "Caucasus mountain folklore depicts it as a reclusive, ape-like wildman surviving in the highlands.",
    "Traits": "Hairy, bipedal, mute, ape-like",
    "Danger Level": 5.5,
    "Behavior": "Keeps distance from humans but has reportedly stolen food or interacted briefly with villagers. Usually avoids direct confrontation.",
    "Summary": "The Abnauayu is a wild humanoid said to inhabit the remote forests of Abkhazia. Often compared to the Almas, it is considered a relict hominin or undiscovered primate. Descriptions portray a hairy biped with a sloped forehead and no language ability. Villagers have reported brief encounters, typically at night or during harsh weather. Some accounts suggest family groups exist in the wilderness. Soviet-era scientists documented local beliefs and anecdotal sightings. No physical evidence or photographic proof has emerged. The creature remains a regional cryptid with limited exposure outside Eurasian folklore.",
    "First Reported Sightings": "1870s",
    "Reported Sightings (Approx.)": 16,
    "Hoaxes": "The Abnauayu is tied to Russian and Caucasian wildman legends. Though no direct hoaxes have been exposed, its similarity to the Almas and other hominid cryptids has led to theories of mistaken identity. It remains unconfirmed and subject to local oral tradition.",
    "Debunked (Y/N)": "No",
    "Cryptid Popularity Score": 4,
    "image": null
  },
  {
    "Index": 13,
    "cryptid-name": "Abominable Swamp Blob",
    "Aliases/Also Known As": "N/A",
    "Media Mentions": "Mentioned sporadically in cryptozoology compilations and internet forums focused on unexplained organic masses. Occasionally cited in connection with “globsters” or sea creature carcasses in tabloid-style reporting. Media mentions are infrequent and lack credible sources or scientific follow-up.",
    "Type": "Ooze/Miscellaneous",
    "Specific Location(s)": "St. Augustine, Florida, United States",
    "Folklore": "Often linked to local U.S. legends of mysterious organic masses washing ashore, typically after storms.",
    "Traits": "Gelatinous, odorless, semi-transparent, stationary, dissolves upon contact",
    "Danger Level": 2.5,
    "Behavior": "It was inert and motionless when found, lacking any indication of aggression. The creature’s stillness and decomposition implied no deliberate behavior.",
    "Summary": "The Abominable Swamp Blob refers to large, gelatinous, unidentified masses that have been found in swamps and coastal regions, often mistaken for sea monsters or alien life. These blobs are typically discovered washed up on shores or lurking in marshes, with no clear anatomical features. Scientists believe most are decomposed remains of whales or large marine animals, though some cases remain unexplained. Their bizarre appearance and foul odor have cemented them as cryptid curiosities and internet legends.",
    "First Reported Sightings": 1955,
    "Reported Sightings (Approx.)": 4,
    "Hoaxes": "Likely the result of decomposing organic material mistaken for a living entity. No verified reports exist beyond local hearsay and internet forums.",
    "Debunked (Y/N)": "Yes",
    "Cryptid Popularity Score": 5,
    "image": "Abominable-Swamp-Blob.png"
  },
  {
    "Index": 14,
    "cryptid-name": "Abura Akago",
    "Aliases/Also Known As": "Oil Baby",
    "Media Mentions": "Referenced primarily in Japanese yokai encyclopedias and art books focused on Edo-period folklore. Rarely appears outside of academic texts on supernatural Japanese entities. Media mentions are minimal and largely limited to cultural studies.",
    "Type": "Spirit/Yokai",
    "Specific Location(s)": "Kyoto Prefecture, Japan",
    "Folklore": "Japanese ghost stories describe it as a fireball spirit taking the form of a baby who licks oil from lamps.",
    "Traits": "Fiery, infant-like, hovering, light-emitting, ephemeral",
    "Danger Level": 1,
    "Behavior": "It appears peacefully as a flame-like infant and is drawn to homes where oil has been wasted. Its behavior is mischievous but nonviolent.",
    "Summary": "The Abura Akago is a Japanese yōkai (supernatural entity) described as the ghostly spirit of a child who licks oil from lamps. Originating in Edo-period folklore, this small, glowing red baby appears at night in homes where oil has mysteriously gone missing. It is said to symbolize the greed or carelessness of the living, especially oil thieves. While not dangerous, its eerie presence and disturbing behavior have made it a staple in ghost stories and cautionary tales throughout Japan.",
    "First Reported Sightings": 1776,
    "Reported Sightings (Approx.)": 3,
    "Hoaxes": "Generally considered folklore without credible sightings. Scholars believe it represents a moral tale rather than a physical entity.",
    "Debunked (Y/N)": "Yes",
    "Cryptid Popularity Score": 3,
    "image": "Abura-Akago.png"
  },
  {
    "Index": 15,
    "cryptid-name": "Abura Sumashi",
    "Aliases/Also Known As": "Oil Ghost",
    "Media Mentions": "Found in Japanese yokai catalogues and local Kumamoto folklore references. Occasionally included in illustrated guides to Japanese spirits and monsters. Media mentions remain rare outside of niche folkloric or manga contexts.",
    "Type": "Spirit/Yokai",
    "Specific Location(s)": "Amakusa, Kumamoto Prefecture, Japan",
    "Folklore": "Kumamoto folklore depicts it as a spirit of someone who stole oil, cursed to roam the mountains forever.",
    "Traits": "Stone-headed, silent, robed, small stature, wanders rural paths",
    "Danger Level": 1,
    "Behavior": "It quietly haunts mountain paths and appears to travelers without engaging. Its presence is more eerie than threatening.",
    "Summary": "Abura Sumashi is a mysterious, potato-headed creature from Japanese folklore, particularly from the Kumamoto region. Believed to be the spirit of someone who stole oil in life—a serious offense in times when oil was precious—this squat figure wears a straw cloak and lurks in mountain passes. While not malevolent, it is known to appear suddenly to travelers, delivering a stare that sends chills. The Abura Sumashi reflects moral lessons about karma and respect for natural resources.",
    "First Reported Sightings": "1800s",
    "Reported Sightings (Approx.)": 4,
    "Hoaxes": "Thought to be a fictional creation rooted in regional ghost stories. No photographic or first-hand evidence has ever been substantiated.",
    "Debunked (Y/N)": "Yes",
    "Cryptid Popularity Score": 3,
    "image": "Abura-Sumashi.png"
  },
  {
    "Index": 16,
    "cryptid-name": "Abyssal Rainbow Gar",
    "Aliases/Also Known As": "N/A",
    "Media Mentions": "Mentioned only in deep-sea cryptid lists and speculative aquatic creature blogs. Lacks any credible scientific documentation or firsthand reports. Media mentions are virtually nonexistent outside internet folklore compilations.",
    "Type": "Aquatic",
    "Specific Location(s)": "Mariana Trench (off coast of Guam, Western Pacific Ocean)",
    "Folklore": "Referenced in speculative ichthyology as a deep-sea cryptid reportedly spotted near ocean trenches.",
    "Traits": "Color-shifting, elongated, deep-dwelling, sharp-toothed, iridescent",
    "Danger Level": 4.5,
    "Behavior": "It drifts through deep ocean currents, avoiding surface disturbance. The creature has shown no interaction with humans and behaves like a passive deep-sea dweller.",
    "Summary": "The Abyssal Rainbow Gar is a modern cryptid allegedly spotted in the deep ocean, described as a long, iridescent fish with gar-like features and bioluminescent stripes. It has been sighted by deep-sea fishermen and submersible operators, but no verified specimen has ever been captured. Its rainbow shimmer and reclusive habitat make it a favorite in speculative marine biology. Some believe it may be a misidentified oarfish or an undiscovered species adapted to extreme depths.",
    "First Reported Sightings": 2007,
    "Reported Sightings (Approx.)": 2,
    "Hoaxes": "No scientific basis has been established for this creature. The few mentions are likely exaggerations of deep-sea fish with bioluminescence.",
    "Debunked (Y/N)": "No",
    "Cryptid Popularity Score": 4,
    "image": "Abyssal-Rainbow-Gar.png"
  },
  {
    "Index": 17,
    "cryptid-name": "Achiyalabopa",
    "Aliases/Also Known As": "Bird Spirit of the Heavens",
    "Media Mentions": "Cited in Borges’ Book of Imaginary Beings and sometimes repeated in mythological fantasy collections. Mentioned briefly in Latin American folklore discussions, though without verified indigenous origin. Media mentions are limited to literary references and fictional creature indexes.",
    "Type": "Mythical Bird",
    "Specific Location(s)": "Zuni Pueblo, New Mexico, United States",
    "Folklore": "Zuni mythology describes it as a massive sky bird with rainbow-colored feathers, now lost to the world.",
    "Traits": "Multi-winged, radiant, colossal, feathered, sky-dwelling",
    "Danger Level": 6,
    "Behavior": "It is said to soar silently through high-altitude skies, rarely seen and never attacking. Its movement suggests a majestic but distant temperament.",
    "Summary": "Achiyalabopa is a divine bird from Pueblo mythology, particularly of the Zuni tribe. It is described as a massive, rainbow-colored avian with metallic feathers that can shoot lightning. Said to be a celestial being or storm spirit, Achiyalabopa serves as both a protector and destroyer, representing nature’s power and unpredictability. Though not a “cryptid” in the modern sense, it features heavily in sacred stories and continues to inspire artwork and storytelling within Indigenous communities.",
    "First Reported Sightings": "1700s",
    "Reported Sightings (Approx.)": 0,
    "Hoaxes": "Believed to be a mythological symbol of power and flight from Zuni legend. No hoaxes have been formally recorded, but its existence is treated purely as allegorical.",
    "Debunked (Y/N)": "Yes",
    "Cryptid Popularity Score": 2,
    "image": "Achiyalabopa.png"
  },
  {
    "Index": 18,
    "cryptid-name": "Achlis",
    "Aliases/Also Known As": "Moose-Horse",
    "Media Mentions": "Appears in some medieval bestiaries and classical fantasy texts with uncertain sourcing. Referenced briefly in Borges’ writings as a mythical elk-like animal. Media mentions are infrequent and primarily literary in nature.",
    "Type": "Mythical Beast",
    "Specific Location(s)": "Roman Empire origin — possibly adapted from Scandinavian elk lore",
    "Folklore": "Ancient Greek sources mention a moose-like creature with backward-facing knees said to live in northern lands.",
    "Traits": "Moose-like, awkward-legged, fur-covered, prehistoric, elusive",
    "Danger Level": 2,
    "Behavior": "It is reclusive and avoids direct contact, moving awkwardly through forested regions. Despite its appearance, it displays no signs of hostility.",
    "Summary": "The Achlis is a creature from Roman and medieval bestiaries, described as a moose-like beast with no joints in its legs, forcing it to sleep standing up or leaning against trees. According to Pliny the Elder and other early sources, it was hunted by cutting down the trees it rested on, causing it to fall helplessly. Though clearly a mythical exaggeration, the Achlis may have been inspired by misinterpretations of elk behavior. It's often cited as an early example of myth blending with misunderstood zoology.",
    "First Reported Sightings": "77 CE",
    "Reported Sightings (Approx.)": 1,
    "Hoaxes": "Widely interpreted as a fictional animal mentioned in ancient texts. Modern scholars regard it as an imaginative construct rather than a genuine cryptid.",
    "Debunked (Y/N)": "Yes",
    "Cryptid Popularity Score": 1,
    "image": "Achlis.png"
  },
  {
    "Index": 19,
    "cryptid-name": "Adam-ayu",
    "Aliases/Also Known As": "N/A",
    "Media Mentions": "Rarely mentioned outside of obscure Asian cryptid lists and unverified sightings databases. Lacks coverage in any formal zoological or folkloric literature. Media mentions are negligible and largely anecdotal.",
    "Type": "Humanoid",
    "Specific Location(s)": "West Papua Province, Indonesia",
    "Folklore": "Siberian tribal lore speaks of a reclusive, apelike forest creature that avoids human contact.",
    "Traits": "Hairless, canine-faced, bipedal, nocturnal, muscular",
    "Danger Level": 3,
    "Behavior": "It moves cautiously near riverbanks, often hidden beneath foliage. The creature does not seek confrontation and appears wary of humans.",
    "Summary": "The Adam-ayu is a little-known cryptid reportedly found in parts of Indonesia. Described as a short, hairy humanoid resembling a primitive ape-man, it is said to avoid human contact and dwell in forested areas. Local tales suggest the Adam-ayu communicates in grunts and shows signs of intelligence, such as tool use and rudimentary shelter-building. Some researchers believe these stories may stem from sightings of undiscovered primates or misidentified humans living off-grid.",
    "First Reported Sightings": 1912,
    "Reported Sightings (Approx.)": 3,
    "Hoaxes": "Lacks credible documentation or eyewitness accounts. No formal hoaxes are recorded, but its status as a cryptid is based solely on anecdote.",
    "Debunked (Y/N)": "No",
    "Cryptid Popularity Score": 2,
    "image": "Adam-ayu.png"
  },
  {
    "Index": 20,
    "cryptid-name": "Adam-Dzhapais",
    "Aliases/Also Known As": "N/A",
    "Media Mentions": "Mentioned occasionally in Central Asian creature compilations and obscure expedition notes. Appears in speculative accounts blending regional myth with hominid lore. Media mentions are extremely limited and unverifiable.",
    "Type": "Humanoid",
    "Specific Location(s)": "Altai Mountains, Altai Republic, Russia",
    "Folklore": "Central Asian folklore depicts it as a wild mountain man known for stealing livestock and food from camps.",
    "Traits": "Humanoid, tall, forest-dwelling, shy, solitary",
    "Danger Level": 4,
    "Behavior": "It emerges only in brief encounters, displaying confusion rather than aggression. Its behavior seems disoriented, with no known attacks.",
    "Summary": "Adam-Dzhapais is a wild-man cryptid from Central Asian folklore, often seen as a cousin of the Almasty or Yeti. Described as a large, hairy humanoid with deep-set eyes and a formidable presence, it reportedly lives in remote mountain ranges and avoids contact with humans. Tales from local herders claim it has been seen scavenging or observing humans from a distance. Soviet-era expeditions occasionally noted similar creatures, but no hard evidence has been gathered to support its existence.",
    "First Reported Sightings": 1994,
    "Reported Sightings (Approx.)": 2,
    "Hoaxes": "Primarily referenced in obscure folklore collections with no tangible evidence. Most researchers classify it as mythical or fabricated.",
    "Debunked (Y/N)": "No",
    "Cryptid Popularity Score": 2,
    "image": "Adam-Dzhapais.png"
  },
  {
    "Index": 21,
    "cryptid-name": "Adar Llwch Gwin",
    "Aliases/Also Known As": "Birds of Rhiannon",
    "Media Mentions": "Found in a few Welsh myth collections and Arthurian-related fantasy anthologies. Sometimes cited in online lists of magical birds or Celtic creatures. Media mentions are scarce and primarily historical or literary.",
    "Type": "Mythical Bird",
    "Specific Location(s)": "Wales, United Kingdom",
    "Folklore": "Welsh mythology describes them as giant, intelligent birds given to warriors by a powerful magician.",
    "Traits": "Intelligent, avian, obedient, sharp-clawed, Welsh folklore-based",
    "Danger Level": 7,
    "Behavior": "It follows commands with uncanny obedience and displays fierce loyalty. In legends, it acts with strategic precision during battle.",
    "Summary": "The Adar Llwch Gwin are mythical giant birds from Welsh folklore, said to possess intelligence and the ability to understand human speech. These creatures were believed to be fiercely loyal to their master, acting as messengers and warriors in battle. Their name roughly translates to 'birds of dust and wind,' evoking their swift, powerful presence. The birds were gifted to a legendary warrior, Drudwas ap Tryffin, by his fairy wife and played a tragic role in his downfall when they misinterpreted his orders. Though legendary, they’ve become a symbol of blind loyalty in Welsh myth.",
    "First Reported Sightings": "1100s",
    "Reported Sightings (Approx.)": 0,
    "Hoaxes": "Rooted in Welsh mythology with no known hoax attempts. Considered allegorical, tied to magical symbolism rather than believed sightings.",
    "Debunked (Y/N)": "Yes",
    "Cryptid Popularity Score": 3,
    "image": "Adar- Llwch-Gwin.png"
  },
  {
    "Index": 22,
    "cryptid-name": "Adaro",
    "Aliases/Also Known As": "Sea Spirits",
    "Media Mentions": "Appears in Melanesian mythology studies and is occasionally referenced in Pacific supernatural documentaries. Included in several cryptid encyclopedias with an emphasis on oceanic deities. Media mentions exist but are limited to cultural interpretations.",
    "Type": "Aquatic Spirit",
    "Specific Location(s)": "Solomon Islands, Pacific Ocean",
    "Folklore": "Solomon Islands folklore tells of malevolent sea spirits that travel on waterspouts and attack fishermen.",
    "Traits": "Merman-like, gilled, spear-throwing, aggressive, dual-natured",
    "Danger Level": 8,
    "Behavior": "It swims aggressively and hurls fish as projectiles at humans, showing territorial hostility. The behavior is unique and violent compared to other oceanic entities.",
    "Summary": "The Adaro are dangerous aquatic spirits from the mythology of the Solomon Islands. Unlike typical mermaid or sea spirit myths, Adaro are malevolent beings that travel via waterspouts and hurl poisonous fish at humans from the sea. Described as half-man, half-fish, with features like a shark fin, gills behind the ears, and even a pufferfish growing out of their head, they represent a darker counterpart to benevolent sea spirits. They’re believed to dwell in the sun’s western path after sunset, symbolizing danger and death from the ocean depths.",
    "First Reported Sightings": "1890s",
    "Reported Sightings (Approx.)": 5,
    "Hoaxes": "Originates from Solomon Islands mythology and is treated as a spiritual concept. No hoaxes have been publicly reported, and its depiction remains within oral tradition.",
    "Debunked (Y/N)": "No",
    "Cryptid Popularity Score": 4,
    "image": "Adaro.png"
  },
  {
    "Index": 23,
    "cryptid-name": "Adjule",
    "Aliases/Also Known As": "Kelb-el-Khela",
    "Media Mentions": "Featured in North African folklore digests and desert cryptid blogs. Cited in occasional travel and mystery documentaries focused on the Sahara. Media mentions are limited and often speculative or secondhand.",
    "Type": "Phantom Canid",
    "Specific Location(s)": "Sahara Desert, Algeria and Mali",
    "Folklore": "Saharan oral tradition claims it is a phantom canine roaming deserts near remote settlements.",
    "Traits": "Wolf-like, desert-adapted, silent, elusive, glowing eyes",
    "Danger Level": 6.5,
    "Behavior": "It roams the desert alone or in small packs, maintaining distance from humans. Its actions are defensive when approached but otherwise elusive.",
    "Summary": "The Adjule is a cryptid canid said to inhabit the harsh expanses of the Sahara Desert. Described as a phantom-like wild dog or hyena with glowing red eyes, the creature is feared by Tuareg nomads who claim it travels in small packs and stalks camps at night. Unlike natural predators, the Adjule is often seen as a ghostly or supernatural entity, believed to bring misfortune or death. Though occasionally considered an undiscovered desert canine, the lack of physical evidence keeps it in the realm of folklore and mystery.",
    "First Reported Sightings": 1928,
    "Reported Sightings (Approx.)": 21,
    "Hoaxes": "Some early photographic “proofs” were later dismissed as misidentified dogs or wolves. Military reports have failed to confirm its presence.",
    "Debunked (Y/N)": "No",
    "Cryptid Popularity Score": 4,
    "image": "Adjule.png"
  },
  {
    "Index": 24,
    "cryptid-name": "Adlet",
    "Aliases/Also Known As": "Dogmen of the North",
    "Media Mentions": "Referenced in Inuit mythology summaries and some modern reinterpretations of Arctic folklore. Briefly mentioned in books exploring werewolf-like creatures globally. Media mentions are sparse but more consistent than most due to cultural origins.",
    "Type": "Humanoid",
    "Specific Location(s)": "Greenland and Northern Canada",
    "Folklore": "In Inuit legend, they are the offspring of a woman and a dog, said to live inland and hunt humans.",
    "Traits": "Part-human, part-canine, aggressive, fast-moving, red-haired",
    "Danger Level": 7.5,
    "Behavior": "It is portrayed as hostile and predatory, often attacking humans on sight. Its behavior is aggressive, driven by vengeance in most tales.",
    "Summary": "The Adlet, also known as Erqigdlit, are half-human, half-dog beings from Inuit mythology. They are the offspring of a human woman and a dog husband, part of a dark legend in which the woman’s father punishes her by sending her hybrid children to distant lands. The Adlet are often portrayed as vicious and warlike, standing on two legs with canine features and incredible speed. They’re sometimes used as a mythological explanation for enemies or strange footprints found in snow. The tale reflects Inuit fears of social transgression and cultural outsiders.",
    "First Reported Sightings": 1888,
    "Reported Sightings (Approx.)": 14,
    "Hoaxes": "The narrative is accepted as part of Inuit legend with symbolic meaning. No hoax has been confirmed, but physical sightings are unsupported.",
    "Debunked (Y/N)": "No",
    "Cryptid Popularity Score": 4,
    "image": "Adlet.png"
  },
  {
    "Index": 25,
    "cryptid-name": "Adze",
    "Aliases/Also Known As": "Ewe Vampire",
    "Media Mentions": "Appears in West African folklore studies and anthropological texts discussing vampiric entities. Occasionally mentioned in documentaries exploring global vampire myths. Media mentions are limited to folklore and ethnographic contexts.",
    "Type": "Vampiric Spirit",
    "Specific Location(s)": "Togo and Ghana, West Africa",
    "Folklore": "Ewe folklore portrays it as a vampiric spirit that can possess people and feed on their life force.",
    "Traits": "Firefly form, blood-drinker, possesses people",
    "Danger Level": 9,
    "Behavior": "It transforms into a firefly to infiltrate homes and feed on blood during sleep. The behavior is predatory but covert, operating primarily at night.",
    "Summary": "The Adze is a vampiric entity from the Ewe folklore of Togo and Ghana. By day, it takes the form of a firefly, able to infiltrate homes through small cracks or keyholes. Once inside, it transforms into a human-like spirit that drains life force and blood from its victims — especially children — often blamed for illness or unexplained deaths. Adzes are also said to possess people, leading to madness or social misfortune. In modern interpretations, they are connected to ideas of witchcraft and psychological manipulation.",
    "First Reported Sightings": 1901,
    "Reported Sightings (Approx.)": 6,
    "Hoaxes": "Most accounts of the Adze stem from West African folklore, particularly as a cautionary tale about shapeshifting spirits. There are no recorded hoaxes, but its role as a vampiric entity is understood to be allegorical.",
    "Debunked (Y/N)": "No",
    "Cryptid Popularity Score": 4,
    "image": "Adze.png"
  },
  {
    "Index": 26,
    "cryptid-name": "Afanc",
    "Aliases/Also Known As": "Avanc",
    "Media Mentions": "Referenced in numerous Welsh mythology books and featured in several popular cryptid encyclopedias. Occasionally mentioned in documentaries exploring lake monsters and Celtic legends. Media mentions are modest but consistent due to its strong cultural folklore presence.",
    "Type": "Lake Monster",
    "Specific Location(s)": "Llyn yr Afanc, Snowdonia, Wales, UK",
    "Folklore": "Welsh legends describe it as a dangerous lake monster that causes floods and drowns those who disturb it.",
    "Traits": "Beaver-crocodile hybrid, aquatic",
    "Danger Level": 6.5,
    "Behavior": "It is known to attack those who disturb its lake or approach its territory. Otherwise, it remains submerged and undisturbed in remote waters.",
    "Summary": "The Afanc is a lake-dwelling monster from Welsh mythology, believed to inhabit Llyn yr Afanc in Snowdonia. Often described as a mix between a beaver, crocodile, and demon, it was said to cause floods by thrashing about in the water, sometimes even killing those who disturbed it. Legends recount attempts to trap and relocate the beast, including one tale where it was dragged out of the lake by a maiden and chained by King Arthur. The Afanc symbolizes the chaos of nature and the dangers hidden beneath calm waters.",
    "First Reported Sightings": 1136,
    "Reported Sightings (Approx.)": 11,
    "Hoaxes": "The Afanc is tied to Welsh mythology and appears in medieval texts as a lake monster. No modern hoaxes have surfaced, and its existence is considered purely symbolic within mythological tradition.",
    "Debunked (Y/N)": "Yes",
    "Cryptid Popularity Score": 5,
    "image": "Afanc.png"
  },
  {
    "Index": 27,
    "cryptid-name": "Afonya",
    "Aliases/Also Known As": "N/A",
    "Media Mentions": "Appears sporadically in Russian folklore forums and regional tales involving forest spirits. Lacks coverage in major cryptid databases or scholarly literature. Media mentions are nearly nonexistent outside Eastern European storytelling compilations.",
    "Type": "Forest Spirit",
    "Specific Location(s)": "Ural Mountains, Russia",
    "Folklore": "Slavic rural tales reference Afonya as a mischievous forest spirit who leads travelers astray.",
    "Traits": "Mossy, bark-like, hunched, humanoid",
    "Danger Level": 2,
    "Behavior": "It is said to roam desolate stretches of road at night, avoiding human contact. When encountered, it behaves erratically but not violently.",
    "Summary": "Afonya is a lesser-known cryptid or forest spirit believed to haunt the dense woodlands of the Ural Mountains in Russia. Described as a hunched, humanoid creature with moss-like hair and bark-like skin, it is elusive and rarely seen. Some regional tales liken it to a forest guardian or elemental, protecting certain groves from logging or human intrusion. Sightings are sporadic and usually second-hand, with Afonya acting more as a mysterious presence than a physical beast. It's occasionally likened to Slavic forest spirits like the Leshy.",
    "First Reported Sightings": 1982,
    "Reported Sightings (Approx.)": 4,
    "Hoaxes": "Mentions of Afonya are sparse and largely anecdotal. No direct hoaxes are documented, though its classification as a cryptid is based solely on regional storytelling.",
    "Debunked (Y/N)": "No",
    "Cryptid Popularity Score": 2,
    "image": "Afonya.png"
  },
  {
    "Index": 28,
    "cryptid-name": "African Capybara",
    "Aliases/Also Known As": "N/A",
    "Media Mentions": "Briefly mentioned in fringe zoology discussions and speculative sightings reports, often conflated with oversized rodents. No credible documentation or historical record supports its existence. Media mentions are extremely rare and lack legitimacy.",
    "Type": "Mammalian Cryptid",
    "Specific Location(s)": "Southern Cameroon, Central African Republic",
    "Folklore": "Often considered a mistaken identity, it appears in colonial-era journals as a giant rodent seen in Africa.",
    "Traits": "Rodent-like, large, semi-aquatic",
    "Danger Level": 1,
    "Behavior": "It is reclusive and avoids detection, preferring swampy or riverbank environments. Reports suggest passive grazing rather than confrontational behavior.",
    "Summary": "The African Capybara is a lesser-known cryptid said to inhabit the wetlands of Southern Cameroon and nearby regions. Described as resembling the South American capybara but with darker fur and slightly longer limbs, it's believed to be either a surviving relative or a convergent evolutionary species. Sightings date back to early colonial reports, where villagers spoke of a water-dwelling beast that looked like an oversized rodent. Researchers have speculated it could be a large species of cane rat or an unclassified rodent. No definitive evidence has been gathered despite occasional sightings near riverbanks. Locals believe the creature is largely harmless and avoids humans. Some folkloric traditions view it as a symbol of luck, especially during rainy seasons.",
    "First Reported Sightings": "1860s",
    "Reported Sightings (Approx.)": 8,
    "Hoaxes": "This cryptid is likely a misidentification of large rodents or exaggerated colonial-era reports. No proven hoaxes exist, but claims lack scientific support and are often linked to confusion with known species.",
    "Debunked (Y/N)": "Yes",
    "Cryptid Popularity Score": 3,
    "image": "African-Capybara.png"
  },
  {
    "Index": 29,
    "cryptid-name": "African Peacocks",
    "Aliases/Also Known As": "N/A",
    "Media Mentions": "Referenced in outdated travel accounts and occasionally mistaken for rare bird species in jungle cryptid stories. Not recognized in formal taxonomy or serious ornithological literature. Media mentions are scattered and largely based on misidentification.",
    "Type": "Avian Cryptid",
    "Specific Location(s)": "Ituri Rainforest, Democratic Republic of the Congo",
    "Folklore": "Associated with royal symbolism and mysticism in some West African folklore due to their vibrant plumage.",
    "Traits": "Bright plumage, elusive, iridescent feathers",
    "Danger Level": 1,
    "Behavior": "They exhibit normal bird-like behavior and remain non-aggressive. Sightings are brief, and they typically flee when approached.",
    "Summary": "Unlike the known Congo peacock, the cryptid referred to as African Peacocks is often said to be larger, more vibrantly colored, and capable of producing hypnotic displays. Indigenous stories speak of these birds as forest guardians, their feathers believed to hold spiritual significance. While zoologists have cataloged similar birds, witnesses claim this version remains uncategorized, with sightings only by torchlight or full moon. Some consider them a forgotten royal species displaced by deforestation. Efforts to photograph or capture specimens have failed. Cryptozoologists are divided between myth and misidentification. The mystery remains unresolved.",
    "First Reported Sightings": 1936,
    "Reported Sightings (Approx.)": 3,
    "Hoaxes": "Despite the exotic name, this refers to exaggerated descriptions of existing bird species. Early colonial observations sometimes inflated their size or behavior, though no deliberate hoaxes have been recorded.",
    "Debunked (Y/N)": "No",
    "Cryptid Popularity Score": 2,
    "image": "African-Peacocks.png"
  },
  {
    "Index": 30,
    "cryptid-name": "Aglebemu",
    "Aliases/Also Known As": "N/A",
    "Media Mentions": "Mentioned in obscure aquatic cryptid lists and occasionally in West African oral tradition summaries. Absent from mainstream folklore or scientific literature. Media mentions are minimal and not substantiated by credible sources.",
    "Type": "Aquatic Cryptid",
    "Specific Location(s)": "Cross River, Nigeria",
    "Folklore": "Unknown folklore origins, but occasionally listed in speculative cryptid compilations referencing aquatic anomalies.",
    "Traits": "Serpentine body, glowing eyes, spiny back",
    "Danger Level": 4,
    "Behavior": "It lurks beneath riverbeds and surfaces unexpectedly, though rarely interacts with humans. Its behavior is unpredictable but not consistently threatening.",
    "Summary": "Aglebemu is a river cryptid believed to haunt the Cross River area in Nigeria. Locals describe it as a serpentine creature with glowing red eyes and a spine lined with jagged fins. It’s said to emit a low hum or vibration when angered, which some associate with supernatural power. Folklore connects it to river spirits and as a guardian of sacred waters. Fishermen tell tales of boats being capsized mysteriously or nets shredded overnight. While no photographs exist, there have been consistent oral reports across generations. Some cryptozoologists suggest it may be a large, unknown eel species or exaggerated crocodile sightings.",
    "First Reported Sightings": 2004,
    "Reported Sightings (Approx.)": 1,
    "Hoaxes": "Documentation is nearly nonexistent outside fringe cryptozoology. It is assumed to be a fabricated name or an obscure misreport with no supporting evidence or known hoaxes.",
    "Debunked (Y/N)": "No",
    "Cryptid Popularity Score": 2,
    "image": "Aglebemu.png"
  },
  {
    "Index": 31,
    "cryptid-name": "Agogwe",
    "Aliases/Also Known As": "Little Hairy Men",
    "Media Mentions": "Cited in multiple cryptozoology books and early 20th-century travel reports from East Africa. Occasionally appears in documentaries or media pieces comparing it to other hominid cryptids like the Orang Pendek. Media mentions are limited but persistent within niche cryptid discussions.",
    "Type": "Humanoid Cryptid",
    "Specific Location(s)": "Eastern Tanzania, Mozambique",
    "Folklore": "East African tribal lore describes it as a small, hairy humanoid seen darting through forests.",
    "Traits": "Small stature, covered in reddish-brown hair",
    "Danger Level": 2.5,
    "Behavior": "It avoids populated areas and quickly retreats into the forest when seen. It shows no signs of aggression and prefers isolation.",
    "Summary": "The Agogwe is a small humanoid creature said to roam the forests of East Africa. Witnesses describe it as standing around 3–4 feet tall with reddish-brown hair and an uncanny human-like gait. British explorers in the early 20th century documented strange sightings in Tanzanian jungles. Locals often speak of Agogwe as forest spirits rather than animals, attributing them intelligence and an aversion to human development. Reports typically involve fleeting glimpses before the creatures vanish into the underbrush. No physical evidence has surfaced, leading some to dismiss the cryptid as a case of mistaken primate identity. Still, the consistency in descriptions has intrigued cryptozoologists.",
    "First Reported Sightings": 1931,
    "Reported Sightings (Approx.)": 25,
    "Hoaxes": "Some early 20th-century explorer reports describe small hairy humanoids in East Africa. Skeptics believe these to be fabrications or misidentifications, though no specific hoax was ever confirmed.",
    "Debunked (Y/N)": "No",
    "Cryptid Popularity Score": 4,
    "image": "Agogwe.png"
  },
  {
    "Index": 32,
    "cryptid-name": "Agrios Anthropos",
    "Aliases/Also Known As": "Wild Men of the Forest",
    "Media Mentions": "Appears in speculative Greek creature compilations and some fringe mythological commentaries. Lacks historical documentation or cultural context in classical texts. Media mentions are negligible and confined to cryptid rumor circles.",
    "Type": "Humanoid Cryptid",
    "Specific Location(s)": "Island of Rhodes, Greece",
    "Folklore": "Greek myth and local shepherd tales tell of a savage forest man surviving in mountain wilderness.",
    "Traits": "Tall, muscular, covered in mossy fur",
    "Danger Level": 6.5,
    "Behavior": "It appears territorial and defensive when approached, especially in rural areas. Reports suggest it acts with caution rather than open hostility.",
    "Summary": "Agrios Anthropos translates to 'Wild Man' in Greek and refers to a forest-dwelling humanoid on the island of Rhodes. Descriptions from ancient and medieval texts suggest a moss-covered man-like creature, often seen in olive groves or forest edges at dusk. The being is said to grunt rather than speak and to flee from human interaction. Ancient Greek myths reference similar beings, leading some to connect Agrios to satyrs or rustic gods. While many locals regard it as folklore, occasional sightings by hikers continue to keep the legend alive. Skeptics suggest it may have originated from early hermits or reclusive humans living in the wild.",
    "First Reported Sightings": 1989,
    "Reported Sightings (Approx.)": 2,
    "Hoaxes": "No formal hoaxes have been uncovered, but the figure appears to be a hybrid invention based loosely on myths and unverified sightings. Its narrative lacks credibility in academic circles.",
    "Debunked (Y/N)": "No",
    "Cryptid Popularity Score": 3,
    "image": "Agrios-Anthropos.png"
  },
  {
    "Index": 33,
    "cryptid-name": "Agta",
    "Aliases/Also Known As": "Anthro-Giant",
    "Media Mentions": "Referenced in Filipino folklore studies and cultural anthropology works focused on forest spirits and tribal beliefs. Sometimes included in Southeast Asian creature features or local legend roundups. Media mentions are modest and primarily rooted in indigenous tradition.",
    "Type": "Humanoid Cryptid",
    "Specific Location(s)": "Sierra Madre Mountains, Luzon, Philippines",
    "Folklore": "Philippine mythology characterizes them as forest spirits or ancestral beings often depicted with red skin and smoking pipes.",
    "Traits": "Tall, dark-skinned, long hair, glowing eyes",
    "Danger Level": 6,
    "Behavior": "It is known to kidnap or mislead travelers in the forest, often as a form of mischief or punishment. Its behavior is considered threatening in local folklore.",
    "Summary": "The Agta are tall, dark-skinned humanoids said to inhabit the forests of the Sierra Madre range. While there exists a real Agta ethnic group, cryptid accounts describe a supernatural race with glowing eyes and the ability to vanish into smoke. They're seen as forest tricksters or guardians depending on the tale. Many stories involve Agta warning travelers of danger or punishing those who disrespect the jungle. Eyewitness accounts come from both locals and soldiers stationed in remote parts of Luzon. Cryptozoologists approach with caution due to the cultural overlap. The legend remains an active part of Philippine rural mythology.",
    "First Reported Sightings": "1990s",
    "Reported Sightings (Approx.)": 18,
    "Hoaxes": "The Agta are a real indigenous people of the Philippines, but stories about monstrous or semi-wild versions are considered colonial distortions. There are no formal hoaxes, but the cryptid interpretation is now viewed as culturally insensitive mythmaking.",
    "Debunked (Y/N)": "No",
    "Cryptid Popularity Score": 4,
    "image": "Agta.png"
  },
  {
    "Index": 34,
    "cryptid-name": "Ah-Een-Meelow",
    "Aliases/Also Known As": "N/A",
    "Media Mentions": "Mentioned only in niche American cryptid compilations with little to no cultural context or origin clarity. No appearances in formal literature or mainstream media. Media mentions are virtually nonexistent outside fringe databases.",
    "Type": "Avian Cryptid",
    "Specific Location(s)": "Colville Indian Reservation, Washington, USA",
    "Folklore": "Native Alaskan folklore mentions it as a land-dwelling, shadowy creature feared for its stealth and cries.",
    "Traits": "Huge wingspan, vulture-like, eerie screech",
    "Danger Level": 4.5,
    "Behavior": "It is passive and largely sedentary, appearing primarily in dreams or altered states. Its presence is more symbolic than physical.",
    "Summary": "Ah-Een-Meelow is a giant bird cryptid described by the Colville Tribe in Washington State. Said to have a wingspan of over 20 feet and an emaciated, vulture-like appearance, the creature is feared for its predatory nature. Its name translates loosely to 'Bone-Cleaner' or 'The One That Feeds on Death.' Some witnesses have reported hearing its shrieking cries at night or spotting it perched atop dead trees. Folklore warns that to see the bird is to be marked by misfortune. While there are no confirmed modern sightings, it remains an ominous figure in regional storytelling.",
    "First Reported Sightings": "1950s",
    "Reported Sightings (Approx.)": 1,
    "Hoaxes": "The creature’s existence is poorly documented and mostly anecdotal. It is assumed to be folkloric in nature, with no proven hoax but no verifiable evidence either.",
    "Debunked (Y/N)": "No",
    "Cryptid Popularity Score": 2,
    "image": "Ah-Een-Meelow.png"
  },
  {
    "Index": 35,
    "cryptid-name": "Ahuitzotl",
    "Aliases/Also Known As": "Water Dog",
    "Media Mentions": "Cited in Aztec mythology texts and Mesoamerican deity references. Occasionally mentioned in documentaries about pre-Columbian monsters or in speculative cryptid blogs. Media mentions are sporadic but tied closely to cultural and historical myth.",
    "Type": "Aquatic cryptid",
    "Specific Location(s)": "Lake Texcoco, Valley of Mexico, Mexico",
    "Folklore": "Aztec mythology feared it as a water-dwelling beast with a hand on its tail, known for drowning victims.",
    "Traits": "Simian body, hand on tail, aquatic, predatory",
    "Danger Level": 8,
    "Behavior": "It is said to lure humans to the water's edge before drowning them. The behavior is strategic and intentionally deceptive.",
    "Summary": "The Ahuitzotl is a creature from Aztec legend said to inhabit the lakes and rivers of central Mexico, especially Lake Texcoco. Described as dog-like with a hand on its tail, it was feared for dragging people underwater. The creature was believed to devour only eyes, teeth, and nails, suggesting ritualistic or supernatural intent. Some scholars see it as symbolic of natural drownings or as a warning myth for children. Its name means 'thorny one of the water.' It appears in multiple codices, including the Florentine Codex. The creature was sometimes associated with the rain god Tlaloc. Its mythos blends fear of water with ceremonial sacrifice elements.",
    "First Reported Sightings": 1519,
    "Reported Sightings (Approx.)": 7,
    "Hoaxes": "Rooted in Aztec mythology, the Ahuitzotl was likely used as a symbolic guardian of sacred waters. While no hoaxes are documented, its depiction is understood to be mythological rather than literal.",
    "Debunked (Y/N)": "Yes",
    "Cryptid Popularity Score": 5,
    "image": "Ahuitzotl.png"
  },
  {
    "Index": 36,
    "cryptid-name": "Ahool",
    "Aliases/Also Known As": "Jungle Bat",
    "Media Mentions": "Appears in several well-known cryptid encyclopedias and has been referenced in documentaries on flying cryptids and bat-like creatures. Mentioned in speculative zoology texts and Southeast Asian folklore summaries. Media mentions are moderate and sustained due to recurring interest in winged humanoid sightings.",
    "Type": "Flying cryptid",
    "Specific Location(s)": "Java Rainforests, Indonesia",
    "Folklore": "Indonesian folklore from Java describes a giant bat-like creature seen soaring above jungle canopies.",
    "Traits": "Giant bat-like wings, ape face, nocturnal",
    "Danger Level": 6,
    "Behavior": "It flies silently above the rainforest canopy and is rarely aggressive unless startled. Most behavior descriptions suggest an elusive, nocturnal existence.",
    "Summary": "The Ahool is said to be a massive bat or flying primate native to Java's dense rainforests. With a wingspan over 10 feet and an ape-like face, it emits a loud ‘a-hoooool’ cry, from which its name is derived. It was first reported in the 1920s by naturalist Dr. Ernest Bartels, who claimed to have seen it up close. Eyewitnesses describe its body as covered in gray fur and capable of agile nocturnal flight. Despite rare sightings, some believe it could be a misidentified giant fruit bat. The Ahool is part of a larger mythos of flying humanoids in Southeast Asia. Its elusive nature has kept it in cryptozoological obscurity.",
    "First Reported Sightings": 1925,
    "Reported Sightings (Approx.)": 16,
    "Hoaxes": "Multiple supposed sightings in Indonesia were later linked to large bat species. Though no individual was caught perpetrating a hoax, the creature is now largely dismissed as mistaken identity or legend.",
    "Debunked (Y/N)": "No",
    "Cryptid Popularity Score": 6,
    "image": "Ahool.png"
  },
  {
    "Index": 37,
    "cryptid-name": "Aitvaras",
    "Aliases/Also Known As": "Hauskapene",
    "Media Mentions": "Referenced in Lithuanian folklore collections and occasionally mentioned in works on European house spirits or dragons. Rarely discussed in mainstream cryptid circles or media. Media mentions are sparse and mostly confined to cultural storytelling anthologies.",
    "Type": "Spirit/Household creature",
    "Specific Location(s)": "Lithuania, rural villages",
    "Folklore": "Baltic mythology presents it as a house spirit that appears as a fiery serpent and brings wealth—at a price.",
    "Traits": "Shapeshifter, snake/firebird form, brings wealth",
    "Danger Level": 3.5,
    "Behavior": "It behaves as a household guardian when treated well, bringing wealth to its chosen family. When offended or mistreated, it may cause mischief or disappear entirely.",
    "Summary": "The Aitvaras is a household spirit from Lithuanian folklore, often taking the form of a black rooster or fiery snake. It's believed to bring wealth to a home by stealing from others, making its blessings morally ambiguous. It is said to enter homes through chimneys and reward those who keep it with riches, but often at a spiritual cost. Many legends warn against killing or offending an Aitvaras, as they can retaliate. It sometimes overlaps with dragon or demon-like imagery in local myths. The Aitvaras may also be linked to broader Indo-European fire-spirit motifs. Despite its criminal tendencies, some households revered it like a guardian.",
    "First Reported Sightings": 1853,
    "Reported Sightings (Approx.)": 5,
    "Hoaxes": "The Aitvaras is rooted in Baltic folklore and is widely understood to be a symbolic house spirit rather than a physical creature. No modern hoaxes have been linked to it, and its role remains mythological.",
    "Debunked (Y/N)": "Yes",
    "Cryptid Popularity Score": 3,
    "image": "Aitvaras.png"
  },
  {
    "Index": 38,
    "cryptid-name": "Aiatar",
    "Aliases/Also Known As": "Forest Fiend",
    "Media Mentions": "Occasionally mentioned in Baltic folklore compilations with limited detail and sparse interpretation. Rarely cited in modern cryptid databases or documentaries. Media mentions are almost nonexistent outside regional mythology summaries.",
    "Type": "Beast",
    "Specific Location(s)": "Carpathian Mountains, Romania",
    "Folklore": "Referenced in obscure European folk tales as a spirit linked to decay and illness, sometimes birdlike in form.",
    "Traits": "Slime-covered, venomous, wolf-like",
    "Danger Level": 5,
    "Behavior": "It quietly lurks in the forest, targeting unsuspecting travelers. Its behavior is stealthy and venomous, but rarely witnessed directly.",
    "Summary": "Aiatar is a lesser-known cryptid from Romanian folklore, described as a large wolf-like beast covered in venomous slime. It is believed to lurk in the deep forests of the Carpathians, attacking any creature that ventures too close. The toxic slime it secretes is said to rot flesh and contaminate water sources. Despite its terrifying traits, it is rarely mentioned outside of obscure regional myths. Some scholars believe it could be a folk memory of diseased wolves or rabid animals. Aiatar is often cited in bestiaries meant to scare children away from wandering into dangerous terrain. Its myth remains localized and rarely appears in modern media.",
    "First Reported Sightings": "1960s",
    "Reported Sightings (Approx.)": 2,
    "Hoaxes": "This creature exists primarily in Finnish folklore and carries strong symbolic weight as a forest demon. There are no recorded hoaxes, and it is generally accepted as a mythological figure rather than a cryptid.",
    "Debunked (Y/N)": "Yes",
    "Cryptid Popularity Score": 2,
    "image": "Aiatar.png"
  },
  {
    "Index": 39,
    "cryptid-name": "Air Rods",
    "Aliases/Also Known As": "Skyfish",
    "Media Mentions": "Widely discussed in paranormal documentaries and internet forums from the early 2000s onward. Frequently analyzed in episodes of shows like “Fact or Faked” and YouTube conspiracy content. Media mentions are numerous but largely discredited as optical artifacts.",
    "Type": "Aerial anomaly",
    "Specific Location(s)": "Various – primarily North America and East Asia",
    "Folklore": "Modern folklore considers them atmospheric entities, often dismissed as camera artifacts or optical illusions.",
    "Traits": "Rod-shaped, translucent, fast-moving, winged",
    "Danger Level": 2,
    "Behavior": "They zip through the air in straight or looping paths, entirely non-aggressive. Their behavior remains unexplained and is more anomalous than threatening.",
    "Summary": "Air Rods, or 'skyfish', are aerial entities captured in video footage as fast-moving rod-shaped blurs. Originally appearing in camcorder footage from the 1990s, they were believed by some to be unknown lifeforms. However, analysis shows most air rods are optical illusions caused by moths or insects captured with slow shutter speeds. Despite widespread debunking, some enthusiasts maintain they are cryptids or even interdimensional beings. They were featured in paranormal shows and YouTube conspiracy videos. Air rods remain a case study in how perception and technology can create new legends. The phenomenon has largely faded with high-frame-rate cameras revealing their true nature.",
    "First Reported Sightings": 1994,
    "Reported Sightings (Approx.)": 350,
    "Hoaxes": "Several videos in the early 2000s claimed to show flying rod-like entities. These were later debunked as optical illusions caused by camera shutter speeds and flying insects, making this one of the most thoroughly debunked cryptid phenomena.",
    "Debunked (Y/N)": "Yes",
    "Cryptid Popularity Score": 6,
    "image": "Air-Rods.png"
  },
  {
    "Index": 40,
    "cryptid-name": "Akita Lion",
    "Aliases/Also Known As": "N/A",
    "Media Mentions": "Mentioned briefly in regional Japanese cryptid lists with little supporting folklore or zoological evidence. Absent from mainstream cryptozoology literature or reputable sightings compilations. Media mentions are almost nonexistent outside speculative creature blogs.",
    "Type": "Beast",
    "Specific Location(s)": "Akita Prefecture, Honshu, Japan",
    "Folklore": "Japanese rural tales describe it as a lion-like beast occasionally spotted in mountain regions of Akita Prefecture.",
    "Traits": "Large cat-lion hybrid, thick fur",
    "Danger Level": 4,
    "Behavior": "It is elusive and avoids populated areas, preferring dense forests. The creature has not displayed hostile behavior in reported sightings.",
    "Summary": "The Akita Lion is a rare mention in Japanese regional folklore, described as a lion-like feline roaming the forests of Akita Prefecture. Said to be covered in a thick, almost mane-like coat, it resembles a hybrid between a mountain lion and a snow leopard. Most accounts are anecdotal, shared by rural villagers or elderly storytellers. It may originate from misidentifications of wild dogs or escaped exotic pets. There are no significant media mentions or documented sightings, and it remains more of a whispered myth than a celebrated legend. Still, it holds a small place in local oral traditions.",
    "First Reported Sightings": "1990s",
    "Reported Sightings (Approx.)": 4,
    "Hoaxes": "No verified sightings or photographic evidence exist for the so-called Akita Lion. It is believed to be a fabrication or a case of mistaken identity, with no formal hoaxes documented but credibility remaining extremely low.",
    "Debunked (Y/N)": "No",
    "Cryptid Popularity Score": 2,
    "image": "Akita-Lion.png"
  },
  {
    "Index": 41,
    "cryptid-name": "Akkorokamui",
    "Aliases/Also Known As": "Giant Octopus Kami",
    "Media Mentions": "Regularly cited in Ainu mythology texts and Japanese yokai encyclopedias. Featured in several international documentaries on sea monsters and giant cephalopods. Media mentions are moderate and supported by cultural myth references.",
    "Type": "Sea monster",
    "Specific Location(s)": "Funka Bay, Hokkaido, Japan",
    "Folklore": "Ainu mythology warns of a gigantic red octopus-like sea monster inhabiting Funka Bay in Hokkaido.",
    "Traits": "Red-skinned, octopus-like, massive (up to 100 ft)",
    "Danger Level": 7.5,
    "Behavior": "It reacts violently to perceived threats, capable of capsizing boats or dragging prey underwater. Otherwise, it remains hidden in deep waters near coastal areas.",
    "Summary": "Akkorokamui is a colossal octopus-like sea monster from Ainu folklore in Hokkaido. Said to inhabit Funka Bay, this bright red creature spans up to 100 feet in length and is revered and feared for its power. It can cause whirlpools and capsize boats, particularly if offended. The Ainu regarded it with both reverence and caution, sometimes offering sacrifices to appease it. Similarities exist with global kraken legends, though Akkorokamui has a distinctly spiritual role in Ainu culture. Modern interest has revived its myth through anime and online cryptid lists. Despite no verified sightings, it's one of Japan’s most well-known sea legends.",
    "First Reported Sightings": 1884,
    "Reported Sightings (Approx.)": 12,
    "Hoaxes": "While some believe in its presence due to regional Ainu legends, there are no modern hoaxes tied to this aquatic entity. It is considered a mythic creature with spiritual and cultural significance rather than a subject of fraud.",
    "Debunked (Y/N)": "No",
    "Cryptid Popularity Score": 6,
    "image": "Akkorokamui.png"
  },
  {
    "Index": 42,
    "cryptid-name": "Alicanto",
    "Aliases/Also Known As": "Gold Bird",
    "Media Mentions": "Included in Chilean folklore anthologies and occasionally referenced in mining lore discussions. Appears in a few Latin American cryptid documentaries and children’s books. Media mentions are modest but regionally consistent.",
    "Type": "Mythical bird",
    "Specific Location(s)": "Atacama Desert, Chile",
    "Folklore": "Chilean miners' folklore says it is a glowing bird that feeds on precious metals and can lead or mislead treasure hunters.",
    "Traits": "Metallic feathers, nocturnal, glows in dark",
    "Danger Level": 2.5,
    "Behavior": "It leads travelers astray or to fortune depending on the intent of the follower. The behavior is secretive but not violent, often symbolic in folk stories.",
    "Summary": "Alicanto is a luminous bird from Chilean folklore, said to appear near mineral-rich areas in the Atacama Desert. Its metallic feathers glow in the dark, and it feeds on gold and silver. Miners believed spotting an Alicanto could lead to fortune or doom, depending on whether they were respectful. The bird cannot fly due to its heavy diet of ore, but can run swiftly through the desert. Legends portray it as both a protector and a harbinger of misfortune. It appears in mining songs and tales, passed down for generations. While rarely mentioned in global media, it remains a beloved Chilean legend.",
    "First Reported Sightings": "1780s",
    "Reported Sightings (Approx.)": 9,
    "Hoaxes": "The Alicanto is a mythological creature from Chilean mining folklore. It was used to explain mysterious disappearances or fortunes in mines. No hoaxes have been recorded, and its origins are accepted as purely allegorical.",
    "Debunked (Y/N)": "Yes",
    "Cryptid Popularity Score": 5,
    "image": "Alicanto.png"
  },
  {
    "Index": 43,
    "cryptid-name": "Alien Big Cats",
    "Aliases/Also Known As": "Phantom Cats",
    "Media Mentions": "Frequently covered in British tabloids and television documentaries about unexplained animals. Mentioned in cryptozoology books and local news segments, especially regarding alleged sightings in the UK countryside. Media mentions are extensive and ongoing.",
    "Type": "Mammalian Cryptid",
    "Specific Location(s)": "United Kingdom (Exmoor, Bodmin Moor, Surrey); Australia; New Zealand",
    "Folklore": "British countryside legends tell of black panthers or leopards mysteriously appearing where they shouldn't.",
    "Traits": "Panther-like, muscular, glowing eyes, silent movement",
    "Danger Level": 6.5,
    "Behavior": "They behave similarly to large predatory felines—stealthy, territorial, and quick to flee when encountered. Attacks are rare but often speculated.",
    "Summary": "Alien Big Cats are mysterious large felines seen roaming non-native environments like the English countryside. Often described as resembling panthers or cougars, these animals have sparked debates over whether they are actual escaped exotics or supernatural entities. The Bodmin Moor sightings in Cornwall gained national attention, leading to investigations and media coverage. Some theories suggest they're relic populations or interdimensional beings. Despite consistent reports, no carcass has ever been found. They are typically solitary and seen at night. DNA evidence from livestock kills sometimes hints at large cats. Eyewitness accounts vary from credible locals to farmers. Their persistence in folklore suggests they may be more than misidentifications.",
    "First Reported Sightings": 1760,
    "Reported Sightings (Approx.)": 150,
    "Hoaxes": "Numerous claims of large non-native cats in places like the UK have led to hoax reports, planted footprints, and staged photographs. While some reports may be sincere misidentifications, multiple cases have been proven to be deliberate fabrications.",
    "Debunked (Y/N)": "No",
    "Cryptid Popularity Score": 6,
    "image": "Alien-Big-Cats.png"
  },
  {
    "Index": 44,
    "cryptid-name": "Aliens",
    "Aliases/Also Known As": "UFO Entities",
    "Media Mentions": "Dominant in global media across film, television, books, and digital platforms for over half a century. Central to major sci-fi franchises and countless documentaries, news stories, and conspiratorial investigations. Media mentions are vast and deeply embedded in pop culture.",
    "Type": "Non-Terrestrial",
    "Specific Location(s)": "Worldwide (notably Roswell NM, Area 51 NV, Rendlesham Forest UK)",
    "Folklore": "Global mythologies and modern UFO lore reference non-human intelligences visiting or abducting people.",
    "Traits": "Humanoid or insectoid forms, large eyes, gray or green skin, advanced technology",
    "Danger Level": 9,
    "Behavior": "Their behavior varies widely depending on the account, ranging from passive observation to active abduction. Most reports describe detached, clinical interactions with minimal emotional intent.",
    "Summary": "Aliens are perhaps the most debated cryptid category, spanning UFOlogy and science fiction. They are often described as technologically superior beings from other planets or dimensions. Notable sightings include Roswell (1947) and the Phoenix Lights (1997), sparking global interest. Popular alien types include the Greys, Nordics, and Reptilians. Their purposes range from scientific observation to abduction, genetic experiments, or even interstellar diplomacy. Aliens dominate conspiracy theories and have left alleged physical traces like implants or radiation marks. Governments like the U.S. have slowly disclosed military footage confirming unidentified aerial phenomena (UAPs). While the scientific community remains skeptical, global belief persists.",
    "First Reported Sightings": 1947,
    "Reported Sightings (Approx.)": "100000+",
    "Hoaxes": "The alien phenomenon has seen countless hoaxes, from doctored UFO photographs to fabricated alien abduction stories. Famous examples include the 1938 \"War of the Worlds\" broadcast panic and the 1995 Roswell autopsy video, both of which were later exposed as misleading or fictional.",
    "Debunked (Y/N)": "No",
    "Cryptid Popularity Score": 10,
    "image": "Aliens.png"
  },
  {
    "Index": 45,
    "cryptid-name": "Almas",
    "Aliases/Also Known As": "Hairy Men",
    "Media Mentions": "Regularly included in cryptozoology encyclopedias and humanoid creature studies, especially in the context of Mongolian and Russian folklore. Appears in documentaries about wild men and lost human relatives. Media mentions are steady and tied to persistent interest in hominid cryptids.",
    "Type": "Hominid",
    "Specific Location(s)": "Caucasus Mountains (Russia/Georgia); Pamir Mountains (Tajikistan); Altai Range (Mongolia)",
    "Folklore": "Mongolian and Russian folklore portrays it as a wild, primitive humanoid that lives in the Altai Mountains.",
    "Traits": "Hair-covered humanoid, bipedal, strong jaw, no speech",
    "Danger Level": 6,
    "Behavior": "It avoids human contact and lives in remote mountain regions. Though physically imposing, it behaves cautiously and has not been known to initiate aggression.",
    "Summary": "The Almas are reclusive ape-like humanoids, often described as more primitive than modern humans. Their legends are deeply embedded in Mongolian and Russian folklore. Unlike Sasquatch, the Almas are seen as closer to Neanderthals, with some theories proposing they are surviving archaic hominins. Many alleged sightings come from shepherds and villagers in the remote regions of the Caucasus. Despite searches by Soviet scientists and cryptozoologists, no remains have been discovered. Reports describe family groups and rudimentary tool use. The Almas are generally non-aggressive and avoid humans. Their consistency across cultures gives them weight in cryptid circles.",
    "First Reported Sightings": 1430,
    "Reported Sightings (Approx.)": 42,
    "Hoaxes": "The Almas, described as a wild man from Central Asia, lacks hard evidence. Some reports have been tied to hoaxes or unreliable secondhand stories, though no single hoax has been definitively identified as the origin.",
    "Debunked (Y/N)": "No",
    "Cryptid Popularity Score": 7,
    "image": "Almas.png"
  },
  {
    "Index": 46,
    "cryptid-name": "Altamaha-ha",
    "Aliases/Also Known As": "Altie",
    "Media Mentions": "Featured in Southern U.S. folklore collections and multiple American cryptid books. Appears in local news stories, travel blogs, and river monster-themed documentaries. Media mentions are moderate and geographically concentrated.",
    "Type": "Aquatic Cryptid",
    "Specific Location(s)": "Altamaha River, near Darien, Georgia, USA",
    "Folklore": "Georgia coastal folklore tells of a river monster seen gliding through the Altamaha River.",
    "Traits": "Gray, seal-like body, 20–30 feet long, multiple humps, alligator-like snout",
    "Danger Level": 5.5,
    "Behavior": "It moves smoothly through rivers and rarely surfaces, avoiding boats and human activity. Reports suggest a shy, almost evasive nature.",
    "Summary": "Altamaha-ha, or 'Altie,' is Georgia's own river monster, often compared to the Loch Ness Monster. Sightings date back to indigenous Muscogee tales and colonial accounts. It is described as a large, serpentine creature with seal-like skin and a long body that undulates through the water. Witnesses have claimed to see it surfacing in tidal rivers near Darien, especially in spring. Although no conclusive photos exist, locals continue to report encounters. It has gained cult popularity and is a feature in local tourism and souvenirs. No harm has ever been attributed to it. The creature is usually seen briefly before disappearing beneath the water.",
    "First Reported Sightings": "1830s",
    "Reported Sightings (Approx.)": 27,
    "Hoaxes": "Sightings of the Altamaha-ha in Georgia’s coastal waterways have never been substantiated. While no direct hoaxer has come forward, several stories are suspected to be tourist-driven fabrications or local lore inventions.",
    "Debunked (Y/N)": "No",
    "Cryptid Popularity Score": 6,
    "image": "Altamaha-ha.png"
  },
  {
    "Index": 47,
    "cryptid-name": "Ameranthropoides loys",
    "Aliases/Also Known As": "Loy's Ape",
    "Media Mentions": "Briefly covered in older cryptozoological texts and sometimes cited in discussions on hoaxes or misidentified primates. Rarely appears in recent media or academic reviews. Media mentions are minimal and often critical in tone.",
    "Type": "Primate",
    "Specific Location(s)": "Venezuela–Colombia border near Rio Tarra",
    "Folklore": "Early 20th-century reports in South America claimed the discovery of a tailless ape resembling a proto-human.",
    "Traits": "Ape-like, no tail, long limbs, facial expressions like humans",
    "Danger Level": 4.5,
    "Behavior": "It was observed standing upright and displaying curiosity toward the observers before being shot. Its behavior was more passive than confrontational, with no indication of aggression.",
    "Summary": "Ameranthropoides loysi is based on a single photo taken by Swiss geologist François de Loys, allegedly showing an ape-like creature with humanlike proportions and no tail. The photo caused a stir in the 1920s as a potential discovery of a South American anthropoid. However, skeptics believe it’s a misidentified spider monkey. Its name was given retroactively to classify it scientifically, despite lack of specimen. It has inspired debates in cryptozoology as a case of either photographic hoax or overlooked species. The original location remains remote and poorly documented. No follow-up sightings have occurred.",
    "First Reported Sightings": 1920,
    "Reported Sightings (Approx.)": 1,
    "Hoaxes": "The photograph of a supposed South American ape-man was presented by François de Loys in the 1920s. It was later determined that the creature was likely a spider monkey posed for scale, making this a documented zoological hoax.",
    "Debunked (Y/N)": "Yes",
    "Cryptid Popularity Score": 4,
    "image": "Ameranthropoides-loys.png"
  },
  {
    "Index": 48,
    "cryptid-name": "American Hyena",
    "Aliases/Also Known As": "Shunka Warakin",
    "Media Mentions": "Appears sporadically in North American cryptid forums and speculative bestiary compilations. Occasionally referenced in discussions of extinct Pleistocene fauna and modern-day sightings. Media mentions are limited and usually anecdotal.",
    "Type": "Mammalian Cryptid",
    "Specific Location(s)": "Upper Midwest US (Minnesota, Iowa, Wisconsin), Great Plains",
    "Folklore": "Frontier folklore in North America includes tales of a hyena-like predator stalking livestock and graveyards.",
    "Traits": "Sloping back, high shoulders, short snout, dark fur",
    "Danger Level": 7,
    "Behavior": "It moves in short bursts and tends to scavenge rather than hunt. While intimidating in appearance, it exhibits evasive behavior when confronted by humans.",
    "Summary": "The American Hyena, or Shunka Warakin, is a predator described as resembling a hyena or wolf-dog hybrid. Tales come from Native American folklore and 19th-century settlers who claimed it stalked livestock and emitted unnatural howls. Some speculate it is a misidentified striped hyena or prehistoric holdout. A mounted specimen was once displayed in a Montana museum and later studied as part of cryptozoological investigations. The creature is feared for its aggression and cunning. It is usually spotted at dusk or dawn. It leaves tracks unlike any known North American mammal and is known to stalk before attacking.",
    "First Reported Sightings": "1850s",
    "Reported Sightings (Approx.)": 14,
    "Hoaxes": "Some alleged sightings have been traced back to escaped exotic pets or misidentified animals. Though no major hoaxes have been confirmed, anecdotal exaggerations and folklore make verification difficult.",
    "Debunked (Y/N)": "No",
    "Cryptid Popularity Score": 5,
    "image": "American-Hyena.png"
  },
  {
    "Index": 49,
    "cryptid-name": "American Lions",
    "Aliases/Also Known As": "N/A",
    "Media Mentions": "Mentioned in paleontological contexts and occasionally confused with cryptid reports involving large feline sightings. Coverage is typically scientific rather than folkloric. Media mentions are present but not tied to cryptozoology narratives.",
    "Type": "Extinct/Fossil Cryptid",
    "Specific Location(s)": "Western and Central United States",
    "Folklore": "Legends persist in rural areas about oversized felines resembling prehistoric lions still roaming wilderness areas.",
    "Traits": "Very large feline, short mane, larger than African lions",
    "Danger Level": 8,
    "Behavior": "They behave like apex predators, stalking prey across vast distances. However, reports of aggression toward humans are rare and often speculative.",
    "Summary": "American Lions refer to supposed sightings of Panthera atrox, a giant extinct lion from the Pleistocene epoch. While traditionally believed extinct for 10,000 years, some cryptozoologists suggest they may have survived in isolated regions. Witnesses describe enormous lions with lighter fur and shorter manes. Sightings often occur in mountainous or desert regions. No hard evidence exists, but fossil records suggest these lions were once common. Some Big Cat sightings in the American West may be linked to this theory. Their rarity makes them a fringe cryptid compared to more sensational cases.",
    "First Reported Sightings": "1870s",
    "Reported Sightings (Approx.)": 6,
    "Hoaxes": "OK great now give me info on documented Hoaxes for these cryptids: 2-5 sentences. No bullets. No headings. Maintain consistent tone",
    "Debunked (Y/N)": "Yes",
    "Cryptid Popularity Score": 6,
    "image": "American-Lions.png"
  },
  {
    "Index": 50,
    "cryptid-name": "Ankylosaur of Katsuro Desert",
    "Aliases/Also Known As": "Desert Ankylosaur",
    "Media Mentions": "Referenced exclusively in speculative dinosaur survival literature and fringe online cryptid lists. Lacks historical or cultural grounding. Media mentions are extremely rare and not substantiated by credible sources.",
    "Type": "Reptilian Cryptid",
    "Specific Location(s)": "Katsuro Desert, Mongolia",
    "Folklore": "Modern myth rooted in paleontological speculation describes a dinosaur-like beast sighted in remote desert regions.",
    "Traits": "Heavily armored, spiked tail, reptilian features",
    "Danger Level": 3,
    "Behavior": "It is described as slow-moving and territorial, often spotted alone. There is no record of direct aggression, suggesting a defensive rather than offensive nature.",
    "Summary": "This cryptid refers to modern-day sightings of a living Ankylosaurus in the remote Katsuro Desert of Mongolia. Eyewitnesses claim to have seen a slow-moving, heavily armored reptile with a clubbed tail. Similar to Mokele Mbembe, it’s considered a possible dinosaur holdover. Sightings are rare and lack photographic evidence, though they persist in Mongolian oral lore. Its environment is sparsely populated and difficult to access. Some scientists dismiss it as a misidentified large lizard or hallucination. Still, cryptid enthusiasts consider it a candidate for surviving prehistoric fauna.",
    "First Reported Sightings": "1970s",
    "Reported Sightings (Approx.)": 2,
    "Hoaxes": "This cryptid appears to be based on speculative accounts from fossil misinterpretations. No legitimate sightings exist, and the few reports seem rooted in paleontological confusion rather than deliberate hoaxes. It is regarded more as a misclassification than a deception.",
    "Debunked (Y/N)": "Yes",
    "Cryptid Popularity Score": 3,
    "image": "Ankylosaur-of-Katsuro-Desert.png"
  },
  {
    "Index": 51,
    "cryptid-name": "Araǵanaqlta’a",
    "Aliases/Also Known As": "N/A",
    "Media Mentions": "Cited in limited regional accounts with little elaboration or cultural documentation. Absent from mainstream cryptid encyclopedias or media. Media mentions are nearly nonexistent outside obscure listings.",
    "Type": "Forest Spirit",
    "Specific Location(s)": "Interior Alaska, near Yukon River tributaries",
    "Folklore": "Inuit oral traditions reference it as a shapeshifter that dwells in icy crevices and mimics human voices.",
    "Traits": "Elusive, tall, camouflaged with bark-like skin, no vocal cords",
    "Danger Level": 6,
    "Behavior": "It remains mostly unseen, believed to whisper or stir winds in the night. Reports focus more on its unsettling presence than on any physical action.",
    "Summary": "Araǵanaqlta’a is a cryptid rooted in Interior Alaskan folklore, often described as a forest guardian with semi-spiritual properties. Indigenous tales describe it as capable of blending with trees and only appearing in liminal states such as dawn or during vivid dreams. It is considered a non-aggressive creature, more concerned with territory and balance. Despite numerous stories, there are no verifiable images or physical traces. Local elders claim that harming the creature leads to spiritual misfortune. It is said to emit a calming presence rather than fear. Cryptozoologists often overlook it due to its supernatural elements. It has been cited in a few obscure anthropological records but rarely discussed beyond that.",
    "First Reported Sightings": "2000s",
    "Reported Sightings (Approx.)": 1,
    "Hoaxes": "There is no evidence of documented hoaxes tied to this entity. It is understood to stem from regional oral traditions and functions more as a spiritual or symbolic figure within its cultural origin.",
    "Debunked (Y/N)": "No",
    "Cryptid Popularity Score": 2,
    "image": null
  },
  {
    "Index": 52,
    "cryptid-name": "Atmospheric Beasts",
    "Aliases/Also Known As": "Sky Creatures",
    "Media Mentions": "Occasionally featured in paranormal-themed podcasts and speculative zoology writings. Mentioned in fringe science and UFO-adjacent communities as potential explanations for aerial anomalies. Media mentions are rare and confined to pseudoscientific media.",
    "Type": "Aerial Entity",
    "Specific Location(s)": "Upper atmosphere; sightings globally (USA, UK, Australia)",
    "Folklore": "Modern paranormal theories speculate about cloud-like living organisms drifting through Earth’s upper atmosphere.",
    "Traits": "Translucent, jellyfish-like, bioluminescent, massive size",
    "Danger Level": 2,
    "Behavior": "They float or drift silently through the sky, seemingly unaffected by human activity. Their behavior is elusive and non-confrontational.",
    "Summary": "Atmospheric Beasts are theorized as biological entities that dwell in the upper atmosphere. They are often described as giant, slow-moving, semi-transparent organisms resembling jellyfish or manta rays. Sightings sometimes overlap with UFO reports, especially those involving large floating shapes. Some theorists suggest they feed on electromagnetic energy or static. Due to their altitude and evasive movement, they are rarely captured on video or radar. Believers argue they are native to Earth but unknown to science. Others propose they are extra-dimensional. Mainstream science does not recognize their existence.",
    "First Reported Sightings": "1870s",
    "Reported Sightings (Approx.)": 120,
    "Hoaxes": "Claims involving floating or translucent sky creatures were popularized in fringe literature and amateur video footage. Many of these videos were later proven to be camera artifacts or misunderstood natural phenomena, leading to widespread debunking. Though not all claims are considered hoaxes, numerous instances involved misrepresentation of common atmospheric effects.",
    "Debunked (Y/N)": "No",
    "Cryptid Popularity Score": 5,
    "image": "Atmospheric-Beasts.png"
  },
  {
    "Index": 53,
    "cryptid-name": "Auli",
    "Aliases/Also Known As": "N/A",
    "Media Mentions": "Appears in scattered cryptid name databases with minimal contextual information or lore. Not found in major mythological or media sources. Media mentions are almost entirely absent.",
    "Type": "Forest Spirit",
    "Specific Location(s)": "Latvia and Lithuania, dense woodlands near Curonian Lagoon",
    "Folklore": "Obscure in origin, some Himalayan tales mention Auli as a creature with hypnotic eyes dwelling at high altitudes.",
    "Traits": "Small, glowing eyes, humanoid shape, wears moss and bark",
    "Danger Level": 4,
    "Behavior": "It is said to guard specific locations, appearing briefly before vanishing. The behavior is mostly symbolic, with no record of violence or pursuit.",
    "Summary": "Auli is a forest-dwelling cryptid known to Baltic folklore, especially in regions bordering the Curonian Lagoon. It is described as a small humanoid entity that appears to the lost or those performing rituals. While often mischievous, it is not considered malevolent. Locals leave offerings to Auli during seasonal festivals for good luck. Reports are mostly anecdotal, passed down generationally. There are no known photos or physical traces. Its presence is more spiritual than physical according to most accounts. It is occasionally blamed for leading travelers astray or causing minor disturbances in nature.",
    "First Reported Sightings": "1800s",
    "Reported Sightings (Approx.)": 3,
    "Hoaxes": "The Auli is rooted in obscure folklore and has no verifiable sightings. No formal hoaxes have surfaced, and its existence is generally tied to oral myth rather than attempts at deception.",
    "Debunked (Y/N)": "No",
    "Cryptid Popularity Score": 2,
    "image": "Auli.png"
  },
  {
    "Index": 54,
    "cryptid-name": "Australian raptor",
    "Aliases/Also Known As": "Thunderbird Raptor",
    "Media Mentions": "Briefly discussed in cryptid compilations focusing on supposed dinosaur survivals in remote areas. Referenced in a few speculative articles about outback sightings. Media mentions are minimal and often dismissed.",
    "Type": "Reptilian Cryptid",
    "Specific Location(s)": "Australian Outback, Northern Territory and Western Australia",
    "Folklore": "Outback sightings describe it as a large, predatory bird said to snatch small animals and occasionally livestock.",
    "Traits": "Feathered, bipedal, sharp claws, piercing call",
    "Danger Level": 7.5,
    "Behavior": "It flies at low altitudes and may display predatory stalking similar to birds of prey. There are no credible reports of attacks on humans.",
    "Summary": "The Australian Raptor is a cryptid reported in remote desert regions of Australia, described as a dinosaur-like creature similar to a Velociraptor. Witnesses claim to see bipedal reptiles sprinting across dirt roads or hunting small animals. Some believe it is a relic population of ancient dinosaurs, possibly evolving to survive in harsh desert climates. Its size is estimated at 1–1.5 meters tall. Reports come mostly from Aboriginal accounts and outback drivers. Despite dramatic descriptions, no evidence has been recorded. It is sometimes associated with Dreamtime stories, though this is debated. Scientists dismiss it as misidentified emus or hallucinations.",
    "First Reported Sightings": "1990s",
    "Reported Sightings (Approx.)": 18,
    "Hoaxes": "This alleged cryptid lacks consistent physical evidence and is often conflated with large birds or misidentified emus. While no specific hoax has been exposed, skepticism remains high due to the vague and anecdotal nature of reports.",
    "Debunked (Y/N)": "No",
    "Cryptid Popularity Score": 3,
    "image": "Australian-raptor.png"
  },
  {
    "Index": 55,
    "cryptid-name": "Azhi Dahaka",
    "Aliases/Also Known As": "Zahhak",
    "Media Mentions": "Prominently featured in ancient Persian mythological texts and Zoroastrian writings. Occasionally appears in scholarly works and cultural mythology documentaries. Media mentions are steady but focused on symbolic rather than cryptozoological interpretation.",
    "Type": "Mythical Serpent",
    "Specific Location(s)": "Persia/Iran, especially in texts like the *Shahnameh*",
    "Folklore": "Zoroastrian mythology portrays it as a three-headed dragon corrupted by evil and chained beneath the earth.",
    "Traits": "Three-headed, serpents for shoulders, enormous body",
    "Danger Level": 9.5,
    "Behavior": "In myths, it acts with destructive intent and apocalyptic motives. It embodies malevolent behavior but exists more as a symbolic force than an actively seen creature.",
    "Summary": "Azhi Dahaka is a legendary creature in Zoroastrian mythology, feared as a bringer of destruction and plague. He is described as having three heads, six eyes, and serpents growing from his shoulders that feed on human brains. His tale represents cosmic struggle between good and evil. In the *Shahnameh*, he is eventually defeated and chained inside a mountain, awaiting the end of the world. Scholars interpret him as a metaphor for tyranny or disease. Some believe his myth was based on early encounters with large reptiles or fossil finds. He is often cited as an archetypal dragon in Persian literature. No physical sightings exist, only historical myth.",
    "First Reported Sightings": "Pre-1000 BCE",
    "Reported Sightings (Approx.)": 0,
    "Hoaxes": "Azhi Dahaka is a mythological dragon from ancient Persian texts. It is not considered a cryptid and has never been the subject of any modern hoax. Its origins are purely literary and symbolic.",
    "Debunked (Y/N)": "Yes",
    "Cryptid Popularity Score": 6,
    "image": "Azhi-Dahaka.png"
  },
  {
    "Index": 56,
    "cryptid-name": "Baclou",
    "Aliases/Also Known As": "N/A",
    "Media Mentions": "Referenced in Guadeloupean folklore and French Caribbean spirit lore collections. Occasionally mentioned in comparative demonology texts. Media mentions are rare and tied closely to regional oral tradition.",
    "Type": "Spirit Familiar",
    "Specific Location(s)": "Benin, Togo, French Antilles",
    "Folklore": "Caribbean and West African folklore warns of a goblin-like creature that grants wealth in exchange for a soul.",
    "Traits": "Tiny humanoid, often hidden in a box or jar, spirit-based",
    "Danger Level": 3.5,
    "Behavior": "It behaves according to how it is treated—generous to those who respect it and vindictive to those who don’t. Most stories involve it working behind the scenes rather than taking direct action.",
    "Summary": "The Baclou is a spirit creature from West African and French Caribbean voodoo traditions. It is believed to be summoned using dark rituals and kept in small containers to serve its master. In exchange for wealth or protection, the Baclou may demand offerings or eventually turn on its owner. The spirit is said to operate invisibly, stealing or sabotaging enemies. Legends warn against mistreating or neglecting the creature. It has no fixed appearance but is often imagined as a small, mischievous figure. The Baclou is sometimes confused with gremlins or imps. Its myth serves as a warning about selfish magic.",
    "First Reported Sightings": "1800s",
    "Reported Sightings (Approx.)": 11,
    "Hoaxes": "The Baclou is a spirit figure in West African and Caribbean folklore. No sightings or hoaxes have been documented, and it is widely recognized as a mythological being rather than a biological entity.",
    "Debunked (Y/N)": "Yes",
    "Cryptid Popularity Score": 3,
    "image": "Baclou.png"
  },
  {
    "Index": 57,
    "cryptid-name": "Baital",
    "Aliases/Also Known As": "Vetala",
    "Media Mentions": "Featured in Indian mythological tales and included in traditional ghost and vampire lore. Occasionally cited in collections of subcontinental supernatural entities. Media mentions are limited and mostly literary.",
    "Type": "Undead Spirit",
    "Specific Location(s)": "India, primarily in Maharashtra and Uttar Pradesh",
    "Folklore": "Hindu legends depict it as a vampiric spirit that hangs upside-down from trees and tells riddles to test humans.",
    "Traits": "Bat-like, ghostly, undead; walks through shadows",
    "Danger Level": 6.5,
    "Behavior": "It is believed to possess or mimic the living, often in secret. Its behavior is deceptive and parasitic rather than openly violent.",
    "Summary": "Baital is a revenant entity from Indian mythology, known for possessing corpses and engaging in riddles with wise men or kings. In the *Baital Pachisi* stories, King Vikram must capture the spirit and answer its questions correctly. Baital resides in cemeteries or trees and can exit bodies at will. It is associated with moral tests and karmic lessons. Modern interpretations portray it as a demonic vampire. It is feared but also respected in rural communities. It appears frequently in Indian popular media. Some scholars consider it a symbolic guardian of justice.",
    "First Reported Sightings": "1060s",
    "Reported Sightings (Approx.)": 5,
    "Hoaxes": "Baital, originating in Indian folklore, is a vampire-like spirit associated with ancient tales. No modern hoaxes have been linked to it, and its role is entirely mythological with symbolic undertones.",
    "Debunked (Y/N)": "Yes",
    "Cryptid Popularity Score": 3,
    "image": "Baital.png"
  }
]